---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BoundarySegment
source: html/3661349e-41e4-b2d7-5c4a-21e002d6b762.htm
---
# BoundarySegment Members

Releases all resources used by the BoundarySegment